{"testimonials":[

{
	"text": "After every session with Michele, I feel a strong sense of relief from muscle soreness. Since I am a very active person, there are times when I am held back by stiffness and overworked muscles. I worry less about these incidents because I trust Michele will get me back, better than ever. It is especially helpful that she works on the problem areas as needed and speeds up the recovery process.",
	"reviewer": "Chad"
},{
	"text": "It has been a great experience coming to Michele for massage therapy. Because of my injuries, I wasn't able to lie on my stomach. Michele accommodated my needs with side bolsters and pillows, in addition to seated massages. Michele is compassionate and thoughtful. Even though my injuries have healed, I will continue using her as a massage therapist!",
	"reviewer": "Sara K"
},{
	"text": "Michele is an outstanding massage therapist who really cares about her client's well-being. Michele adjusts her technique to fit the individual's needs and ensures that you get the most from your time with her. Michele constantly attends workshops and seminars to improve her skills and to expand her knowledge in massage therapy; particularly in the area of working with cancer patients and survivors. I highly recommend Michele as a massage therapist.",
	"reviewer": "Debbie Bambrick"
},{
	"text": "Thank you Michele, I use my therapy wrap multiple times a day, they are wonderful! I am also getting some for Christmas presents. I have been sending some folks I work with your way also, we will keep coming!",
	"reviewer": "Gerbeca, Michigan"
},{
	"text": "Thank you once again for the heat wrap. As a new mom, I have to tell you I have been using the heat wrap everyday. It helps tremendously around my neck but I have also been warming it and putting it on my chest as my milk has come in to ease some of the pain and engorgement. It has been a lifesaver. So thank you again!",
	"reviewer": "Cyndi P., Fort Worth, TX"
},{
	"text": "Since retiring, I've dramatically picked up the level of my recreational activities, particularly biking, and had been plagued with corresponding chronic aches and pains. I haven’t had a massage in years but since beginning a scheduled program of massage therapy with Michele, I have an increased level of muscular flexibility that has definitely helped improve performance. I've found the massage therapy to be more effective then NSAID in relieving muscular discomfort, and it's been especially helpful on those occasions where I had localized pain in my lower back and quads. In addition to all my other comments, let me add that it is just totally relaxing",
	"reviewer": "Denis Mackey"
},{
	"text": "Your neck wrap helped to save me from surgery! I had severe neck pain, had an MRI and found a problem with the way my discs were sitting in my neck C4-C5. Saw the surgeon and he said I could hold off until the pain became unbearable. I started on Motrin and using your Steeler neck wrap on my way to work, at work, and at bedtime. It has now been probably 3 months, I have full range of motion in my neck, and the pain is minimal. I will continue to use your wrap. At work my staff is constantly asking me to use the wrap for aches and pains. My son has a lower back basketball injury and constantly uses the wrap on his lower back. He is 17 and asks me to heat it up for him. Best device ever, would recommend it to anyone.",
	"reviewer": "Diane Hester, Pennsylvania"
}

]}
				